Tekla Open API Reference for Tekla Structures 2025
EdgeEnumerator Methods
The EdgeEnumerator type exposes the following members.
Methods
Name | Description
MoveNext
 Moves to the next item in the enumerator.
Reset
 Resets the enumerator to the beginning.
Top
See Also
Reference
EdgeEnumerator Class
Tekla.Structures.Solid Namespace